TestEDT/src/Enums/уа_ОценочнаяКатегория/уа_ОценочнаяКатегория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ОценочнаяКатегория</name>
  <enumValues>
    <name>АктивыПоСправедливойСтоимостиПрибыль</name>
  </enumValues>
  <enumValues>
    <name>АктивыДляПерепродажи</name>
  </enumValues>
  <enumValues>
    <name>ИнвестицииДоПогашения</name>
  </enumValues>
  <enumValues>
    <name>АктивыПоАмортизированнойСтоимости</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_КатегорииАктива/уа_КатегорииАктива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_КатегорииАктива</name>
  <enumValues>
    <name>Акция</name>
  </enumValues>
  <enumValues>
    <name>Облигация</name>
  </enumValues>
  <enumValues>
    <name>Пай</name>
  </enumValues>
  <enumValues>
    <name>ДепозитарнаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ИпотечныйСертификатУчастия</name>
  </enumValues>
  <enumValues>
    <name>Вексель</name>
  </enumValues>
  <enumValues>
    <name>Опцион</name>
  </enumValues>
  <enumValues>
    <name>Фьючерс</name>
  </enumValues>
  <enumValues>
    <name>СВОП</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_ОценочнаяКатегория/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Определяет возможные оценочные категории для категории ЦБ.
//
// Параметры:
//  КатегорияЦБ - ПеречислениеСсылка.УПЦБКатегорииЦБ - категория ЦБ.
//
// Возвращаемое значение:
//  ФиксированныйМассив - массив возможных оценочных категорий.
//
Функция ОценочныеКатегорииПоКатегорииЦБ(КатегорияЦБ) Экспорт
	
	ОценочныеКатегории = Новый Массив;
	Категория = Перечисления.уа_ОценочнаяКатегория;
	Если КатегорияЦБ = Перечисления.уа_КатегорииАктива.Акция Или 
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.Пай Или 
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.ДепозитарнаяРасписка Или 
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.ИпотечныйСертификатУчастия Тогда
		
		ОценочныеКатегории.Добавить(Категория.АктивыПоСправедливойСтоимостиПрибыль);
		ОценочныеКатегории.Добавить(Категория.АктивыДляПерепродажи);
		
	ИначеЕсли КатегорияЦБ = Перечисления.уа_КатегорииАктива.Облигация Или 
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.Вексель Тогда
		
		ОценочныеКатегории.Добавить(Категория.АктивыПоСправедливойСтоимостиПрибыль);
		ОценочныеКатегории.Добавить(Категория.АктивыДляПерепродажи);
		ОценочныеКатегории.Добавить(Категория.ИнвестицииДоПогашения);
		ОценочныеКатегории.Добавить(Категория.АктивыПоАмортизированнойСтоимости);   
		
	ИначеЕсли КатегорияЦБ = Перечисления.уа_КатегорииАктива.Фьючерс ИЛИ
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.Опцион ИЛИ
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.СВОП Тогда
		
		ОценочныеКатегории.Добавить(Категория.АктивыПоСправедливойСтоимостиПрибыль);		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ОценочныеКатегории);
	
КонецФункции    


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
